Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/cathaoirleach_of_seanad_eireann.html.txt.tmx
Source language: en
Languages: ga

source: Cathaoirleach of Seanad Éireann
ga: Cathaoirleach ar Seanad Éireann

source: The first thing that a new Seanad does after a general election is to elect a Cathaoirleach from the Senators
ga: An chéad rud a bhíonn le déanamh ag Seanad nua tar éis ollthoghcháin Cathaoirleach nua a thoghadh i measc na Seanadóirí

source: The Cathaoirleach is the chairperson of the Seanad and must act impartially
ga: Ní mór do Chathaoirleach an tSeanaid gníomhú go neamhchlaonta

source: The Cathaoirleach chairs the proceedings in the House and can nominate a panel of temporary Chairpersons from the Senators to assist
ga: Bíonn an Cathaoirleach sa chathair do chruinnithe an Tí agus is féidir leis/léi painéal Cathaoirleach sealadach a ainmniú i measc na Seanadóirí le cúnamh a thabhairt dó/di

source: You can find details of the current Cathaoirleach here
ga: Tá faisnéis faoin gCathaoirleach reatha ar fáil

source: The Cathaoirleach has a number of important functions:
ga: Tá roinnt feidhmeanna tábhachtacha ag an gCathaoirleach:

source: • Calling on members to speak
ga: • Cuireann sé/sí glaoch ar chomhaltaí le labhairt

source: All speeches in the Seanad must be directed to the Cathaoirleach
ga: Is tríd an gcathaoir a dhéantar gach óráid sa Seanad

source: The Cathaoirleach can put forward a motion for the closure of a debate when they consider that the issue has been adequately discussed
ga: Is féidir leis an gCathaoirleach rún a mholadh deireadh a chur le díospóireacht nuair a cheapann sé/sí go bhfuil dóthain plé déanta ar cheist

source: • Putting questions to the Seanad for voting, supervising the voting and declaring the results
ga: • Ceisteanna a chur ós comhair an tSeanaid le vóta a chaitheamh, maoirseacht a dhéanamh ar an vótáil agus na torthaí a fhógairt

source: • Keeping proceedings under control and maintaining order in the Seanad
ga: • Smacht agus ord a choinneáil sa Seanad

source: The Cathaoirleach can order members to leave the Seanad and can recommend that certain members be disciplined by the Seanad
ga: Is féidir leis an gCathaoirleach ordú a thabhairt do Sheanadóirí imeacht agus moladh a dhéanamh go gcuirfeadh an Seanad smacht ar chomhaltaí

source: If there is great disorder, the Cathaoirleach can suspend or adjourn the Seanad
ga: Má tá rí rá sa Teach is féidir leis an gCathaoirleach an Seanad a chur ar fhionraí nó a chur ar atráth

source: • Supervising procedure in the Seanad - making sure that motions and amendments conform to the rules relating to procedure in the Seanad
ga: • Maoirseacht a dhéanamh ar an obair sa Seanad - déanamh cinnte go bhfuil rúin agus leasuithe ag teacht le rialacha oibre an tSeanaid

source: The Cathaoirleach is the Chairperson of the Seanad Committee of Procedure and Privileges, which considers matters of procedure generally and recommends amendments to the Standing Orders
ga: Bíonn an Cathaoirleach ina C(h)athaoirleach freisin ar Choiste Modhanna agus Pribhléidí an tSeanaid a bhreathnaíonn ar cheisteanna a bhaineann le modh oibre go ginearálta agus a mholann leasuithe do na hOrduithe Seasta

source: The Standing Orders are a list of rules of procedure that are applied by the Cathaoirleach
ga: Liosta rialacha don mhodh oibre iad na hOrduithe Seasta a chuireann an Cathaoirleach i bhfeidhm

source: • The Cathaoirleach has the casting vote in any case where there is a tie or equality of votes in the Seanad
ga: • Tá vóta réitigh ag an gCathaoirleach in aon chás go mbíonn na vótaí atá caite cothrom ar son nó i gcoinne ceiste

source: • The Cathaoirleach represents the Seanad at international meetings of parliamentarians
ga: • Bíonn an Cathaoirleach i láthair ag cruinnithe idirnáisiúnta parlaiminte ar son an tSeanaid
